<?php
//返回值输出
return [
	200 => '成功',
	201 => '失败',
	100 => '当前应用维护中',
	101 => '当前版本维护中',
	102 => '注册功能已关闭',
	103 => '登录功能已关闭',
	104 => '邮箱发信功能未开启',
	105 => '短信发信功能未开启',
	106 => '支付宝支付方式未开启',
	107 => '微信支付方式未开启',
	109 => '签名验证失败',
	110 => '客户端时间校验失败',
	111 => '数据不能为空',
	112 => '未配置加密密钥',
	113 => '数据解密失败',
	114 => '未知加密方式',
	
	116 => '验证码获取频繁',
	117 => '今日获取验证码上限',
	118 => '验证码为空',
	119 => '验证码不正确',
	
	120 => '账号已存在',
	121 => '注册频繁',
	122 => '邀请ID不存在',
	123 => '您已经设置过账号了',
	124 => '您已经绑定过邮箱了',
	125 => '您已经绑定过手机号了',
	
	126 => '账号或密码有误',
	127 => '当前账号已禁用',
	128 => '无效Token令牌',
	129 => '用户不存在',
	130 => '无权Token令牌',
	131 => 'Token令牌已失效',
	
	132 => '密码不正确',
	133 => '新密码与当前密码一致',
	134 => '今日已经签到过了哦',
	
	140 => '卡密不存在',
	141 => '卡密已被使用',
	142 => '未知卡密类型',
	
	146 => '积分事件不存在',
	147 => '您已经兑换过一次了',
	
	150 => '当前支付方式未开启',
	151 => '购买商品不存在',
	152 => '商品已下架',
	153 => '购买代理组不存在',
	
	156 => '支付请求失败',
	157 => '订单数据解析失败',
	
	
	170 => '您的VIP已到期，无法完成本次解绑',
	171 => '您的积分余额不足，无法完成本次解绑',
	172 => '您绑定的设备数量已上限，无法绑定更多设备了',
	
	180 => '您的代理资质已被禁用',
	199 => '您是永久会员无法继续充值',
];